brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

// Colors only valid on the nRF52840 dongle. On the DK there are four different LEDs all of which are yellow.
// LED_0 is the other LED which is green-yellow
// LED_1 is red
// LED_2 is green
// LED_3 is blue

#define ADVERTISING_LED                 BSP_BOARD_LED_2                         /**< Is on when device is advertising. */ 
#define ERROR_LED                       BSP_BOARD_LED_1
#define CONNECTED_LED                   BSP_BOARD_LED_3                         /**< Is on when device has connected.*/
#define MSMT_DATA_LED                  (BSP_BOARD_LED_3 | BSP_BOARD_LED_1)      /**< Flashes pink when Keiser data is received and queued. */
#define DISCONNECTED_LED                BSP_BOARD_LED_0


static unsigned long elapsedTimeStart;

//static unsigned short mtu_size                                = 23;
static unsigned short data_length                               = 27;  // Max size of advertisement?
static bool flash_write_needed                                  = true;
//static bool start_shutdown                                      = false;
//static unsigned long done_timer                                 = 0;

APP_TIMER_DEF(m_ghs_disconnect_timer_id);      /**< disconnect handler */
APP_TIMER_DEF(m_ghs_live_data_timer_id);
APP_TIMER_DEF(m_ghs_flash_write_timer_id);
APP_TIMER_DEF(m_app_dummy_timer_id);

//nrf_nvic_state_t nrf_nvic_state = {0};      // Docs say this is needed in some C file to use NVIC via SoftDevice - we use system reset

#define RACP_CCCD_INDEX 0
#define STORED_DATA_CCCD_INDEX 1
#define LIVE_DATA_CCCD_INDEX 2
#define GHS_CP_CCCD_INDEX 3

//static uint8_t                  m_adv_handle                    = 0;  // For advertisments
//static uint32_t                 m_config_id                     = 1;  // For advertisments
static bool                     stored_data_done_sent;

static uint16_t                 m_connection_handle             = BLE_CONN_HANDLE_INVALID;     /**< Handle of the current connection. */
static uint16_t                 m_ghs_bt_sig_service_handle     = BLE_GATT_HANDLE_INVALID;
static ble_gatts_char_handles_t m_ghs_bt_sig_cp_handle;
static ble_gatts_char_handles_t m_racp_handle;
static ble_gatts_char_handles_t m_ghs_bt_sig_stored_data_not_handle;
static ble_gatts_char_handles_t m_ghs_bt_sig_live_data_not_handle;
static ble_gatts_char_handles_t m_ghs_bt_sig_feature_handle;
static ble_gatts_char_handles_t m_ghs_bt_sig_security_handle;
static uint16_t                 m_clock_info_service_handle     = BLE_GATT_HANDLE_INVALID;
static ble_gatts_char_handles_t m_clock_info_handle;
static uint16_t                 m_dev_info_service_handle       = BLE_GATT_HANDLE_INVALID;
static uint16_t                 m_battery_service_handle        = BLE_GATT_HANDLE_INVALID;
static unsigned char            cccdSet[4]                      = {0, 0, 0, 0};
static unsigned short           noOfCccds                       = 4;
static bool                     hasEncrypted                    = false;
static bool                     live_data_mode                  = false;
static bool                     racp_mode                       = false;
static unsigned long            live_data_count                 = 0;

static volatile bool            ghs_abort                       = false;
static ble_gap_sec_params_t     own_sec_params;
static ble_gap_sec_params_t     peer_sec_params;
static ble_gap_sec_keyset_t     keys;
static uint16_t                 saveDataLength                  = 0;
static uint8_t                  *saveDataBuffer                 = NULL;
static volatile bool            restartAdv                      = false;
static uint8_t                  frag_header                     = 0xFC;
static unsigned char            charBuff[8];
static unsigned char            racp_request;
unsigned short                  num_records_to_send             = 0;

uint16_t                        current_char_handle             = BLE_GATT_HANDLE_INVALID;
ble_gap_conn_params_t           gap_conn_params;
nrf_mutex_t p_mutex;
nrf_mutex_t q_mutex;
//static __align(4) uint32_t evt_buf[CEIL_DIV(BLE_STACK_EVT_MSG_BUF_SIZE, sizeof(uint32_t))];
__ALIGN(4) uint8_t *evt_buf;
__ALIGN(4) uint8_t *evt_buf2;

static uint8_t cpResponse[4];
char buffer[256];
char msmt_buffer[512];

//=========================== PARAMETERS FOR GHS DATA
s_Queue *queue;


/*
 This GHS sends indications on two characteristics. These variables tell the indicate data method
 which handles (characteristics) to send indications on.
 When the PHD receives a command, the GHS will do one of two things:
    1. indicate a response on the control point characteristic indicating the command has been handled.
       The PHG may send the next command.
    2. indicate a one or more responses on the response characteristic (the response may be fragmented over
       several indications, such as the systemInfo and the measurement groups)
       then indicate a response on the control point characteristic - usually this means the PHD is done
       handling the command, but it may also indicate a measurement group has been completed but more are
       to come. In that case the PHG just handles the measurement group and waits for more. It shall NOT
       send another command. The PHD will send a final response indicating the measurement groups are completed,
       ending the command. Now the PHG may send the next command.
       
       In the live data situation, the command never completes. The PHD will just send measurement groups
       on the response characteristic followed by group finished response on the control point and then
       continue with the next. When the PHD has no more data to send it disconnects. 
 */

volatile s_global_send global_send;
static volatile bool send_flag = false;

extern unsigned short pairing;          // Value of 1 indicates that pairing/bonding is required.
extern unsigned char batteryCharValue;
extern s_SystemInfo *systemInfo;
extern char *DEVICE_NAME;
extern unsigned short SPECIALIZATION;
extern unsigned short BLE_APPEARANCE;

