brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
unsigned char GET_NUMBER_OF_RECORDS_RESP_SUCCESS[4]   = {0x05, 0x00, 0x00, 0x00};  // same for all, gte, first. last operators. Last two bytes number of records
unsigned char GET_RECORDS_RESP_SUCCESS[4]             = {0x06, 0x00, 0x01, 0x01};  // same for all, gte, first. last operators
unsigned char GET_COMBO_RECORDS_RESP_SUCCESS[4]       = {0x08, 0x00, 0x00, 0x00};  // Same set of responses for all combo cases. Last two bytes number of records sent
unsigned char DELETE_RECORDS_RESP_SUCCESS[4]          = {0x06, 0x00, 0x02, 0x01};  // same for all, gte, first. last operators 

unsigned char RESP_NO_RECORDS[4]                = {0x06, 0x00, 0x00, 0x06};  // need to fill [2] with the op-code (01 for get records, 07 for combo, 02 for delete)
unsigned char RESP_OPCODE_UNSUPPORTED[4]        = {0x06, 0x00, 0x00, 0x02};  // need to fill [2] with the op-code
unsigned char RESP_OPER_UNSUPPORTED[4]          = {0x06, 0x00, 0x00, 0x04};  // need to fill [2] with the op-code
unsigned char RESP_SERVER_BUSY[4]                  = {0x06, 0x00, 0x00, 0x0A};  // need to fill [2] with the op-code

//unsigned char MSMT_RECORD_COMPLETED[2] = {0xFF, 0xFF};
//unsigned char SENSOR_DONE[2]           = {0xFF, 0xFE};

// For live data CP
unsigned char GHSCP_RSP_SUCCESS[1] =  {0x80};
unsigned char GHSCP_RSP_BUSY[1] = {0x81};
unsigned char GHSCP_RSP_LIVE_CCCD_DISABLED[1] = {0x82};
unsigned char GHSCP_RSP_UNKNOWN_COMMAND[1] = {0x83};

// Time clock
unsigned long prevCount = 0;
static unsigned long long cycles = 0;
unsigned long long accumulatedCycleCount = 0;
unsigned long long getRtcCount()  // Returns the number of elapsed ticks where 32768 ticks is one second
{
    unsigned long  count = app_timer_cnt_get();
    if (count < prevCount)
    {
        cycles++;
        accumulatedCycleCount = accumulatedCycleCount + (unsigned long long)(MAX_RTC_COUNTER_VAL);
        NRF_LOG_DEBUG("Time cycled. Cycles %u  accumulatedCycleCount %u\r\n", cycles, accumulatedCycleCount);
    }
    prevCount = count;
    return (unsigned long long)count + accumulatedCycleCount;
}

/*
 * Clock has 32768 ticks per second
 * 1 tick = 30.517578125 microseconds
 *          .030517578125 milliseconds
 *          .000030517578 seconds
 *  seconds = (ticks + 16384) /32768
 *  10ths of milliseconds = (ticks + 1.6384) / 3.2768
 *  milliseconds = (ticks + 16.384) / 32.768
 * or
 *  xth seconds = (FACTOR * ticks + 16384) / 32768  (this gives rounds when using integer divides)
       where FACTOR = 1 for seconds, 10 for tenths, 100 for hundredths, and 1000 for milliseconds
 */
static unsigned long long getRtcTicks()
{
    unsigned long long count = getRtcCount() - elapsedTimeStart;
    return ((count * factor + 16384) / 32768);
}

static unsigned long getTicks()
{
    unsigned long long count = getRtcCount() - elapsedTimeStart;
    return (unsigned long)((count * 1000 + 16384) / 32768);
}


static void sec_params_init(void)
{
    own_sec_params.bond            = SEC_PARAM_BOND;
    own_sec_params.mitm            = SEC_PARAM_MITM;
    own_sec_params.io_caps         = SEC_PARAM_IO_CAPABILITIES;
    own_sec_params.oob             = SEC_PARAM_OOB;
    own_sec_params.min_key_size    = SEC_PARAM_MIN_KEY_SIZE;
    own_sec_params.max_key_size    = SEC_PARAM_MAX_KEY_SIZE;
    own_sec_params.kdist_peer.enc  = 1;     // peer to send their encryption key;
    own_sec_params.kdist_peer.id   = 1;     // peer to send its IRK
    own_sec_params.kdist_peer.link = 0;     // peer to derive link key from LTK - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_peer.sign = 0;     // peer to send signature resolving key - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_own.enc   = 1;     // We distribute our LTK
    own_sec_params.kdist_own.id    = 1;     // We distribute our IRK (even though we don't use resolvable random addressing
    own_sec_params.kdist_own.link  = 0;     // we are to derive link key from LTK - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_own.sign  = 0;     // We to send signature resolving key - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
}

#define ADVERTISING_INTERVAL_40_MS 64  /**< 0.625 ms = 40 ms */
#define BUFFER_SIZE 30
static ble_gap_adv_params_t     m_adv_params;
static uint8_t  data_buffer[BUFFER_SIZE];
static uint8_t  scan_rsp_buffer[BUFFER_SIZE];
uint32_t advertisement_ghs_set(void)
{
    uint32_t error_code;
    uint8_t  index = 0;
    uint8_t  scan_index = 0;
    memset(buffer, 0, 256);
    memset(data_buffer, 0, sizeof(data_buffer));
    memset(scan_rsp_buffer, 0, sizeof(scan_rsp_buffer));

    const uint8_t name_length = (uint8_t)strlen(DEVICE_NAME);

    // Set the flags - important to indicate no EDR/BR support for some Androids
    // Actually by spec one is SUPPOSED to set one of the discoverable flags to be discoverable.
    data_buffer[index++] = 2;        // length of flags data type
    data_buffer[index++] = BLE_GAP_AD_TYPE_FLAGS;
    data_buffer[index++] = BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE | BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;    // No EDR/BR support and general discoverable

    scan_rsp_buffer[scan_index++] = 3;        // length of appearance data type
    scan_rsp_buffer[scan_index++] = BLE_GAP_AD_TYPE_APPEARANCE;
    scan_rsp_buffer[scan_index++] = (BLE_APPEARANCE & 0xFF);
    scan_rsp_buffer[scan_index++] = ((BLE_APPEARANCE >> 8) & 0xFF);

    // Set the device name.
    if (DEVICE_NAME != NULL)
    {
        scan_rsp_buffer[scan_index++] = name_length + 1; // Device name + data type
        scan_rsp_buffer[scan_index++] = BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME;
        memcpy((char*)&scan_rsp_buffer[scan_index++], DEVICE_NAME, name_length);  // destination, source, length
        scan_index += name_length;
    }

    // Set the device's service.
    data_buffer[index++] = 1 + 2;
    data_buffer[index++] = BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE;
    // Store in little-endian format.
    data_buffer[index++] = BTLE_GHS_BT_SIG_SERVICE & 0xFF;
    data_buffer[index++] = (BTLE_GHS_BT_SIG_SERVICE & 0xFF00) >> 8;
    // Add the Service Data for the specializations
    data_buffer[index++] = 1 + 2 + 1 + 2 * 1; // numberOfSpecializations (1) + specialization //+ pairing option;
    data_buffer[index++] = BLE_GAP_AD_TYPE_SERVICE_DATA;
    // Store in little-endian format.
    data_buffer[index++] = BTLE_GHS_BT_SIG_SERVICE & 0xFF;
    data_buffer[index++] = (BTLE_GHS_BT_SIG_SERVICE & 0xFF00) >> 8;

    data_buffer[index++] = 1;
    data_buffer[index++] = (SPECIALIZATION & 0xFF);
    data_buffer[index++] = ((SPECIALIZATION >> 8) & 0xFF);
    //data_buffer[index++] = (unsigned char)pairing;        // Support pairing option

    // Used in start advertising:
    memset(&m_adv_params, 0, sizeof(ble_gap_adv_params_t));
    m_adv_params.channel_mask.ch_37_off = 0;
    m_adv_params.channel_mask.ch_38_off = 0;
    m_adv_params.channel_mask.ch_39_off = 0;
    m_adv_params.type = BLE_GAP_ADV_TYPE_ADV_IND;   // general connectable scannable
    m_adv_params.fp = BLE_GAP_ADV_FP_ANY;           // Any one can scan and connect
    m_adv_params.interval = ADVERTISING_INTERVAL_40_MS;
    m_adv_params.timeout = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;


    memset(buffer, 0, 256);
    NRF_LOG_INFO("Advertisement is %s\r\n", (uint32_t)byteToHex(data_buffer, buffer, " ", index));
    NRF_LOG_FLUSH();
    if (scan_index > 0)
    {
        memset(buffer, 0, 256);
        NRF_LOG_INFO("Scan response is: %s\r\n", (uint32_t)byteToHex(scan_rsp_buffer, buffer, " ", scan_index));
        NRF_LOG_FLUSH();
    }

