brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}
*/

static void getCurrentTime()
{
    updateCurrentTimeEpoch(&sTimeInfoData, (unsigned long long)getRtcTicks() + epoch);
    memset(buffer, 0, 64);
    NRF_LOG_INFO("Getting the current time info: %s\r\n", (uint32_t)byteToHex(sTimeInfoData->timeInfoBuf, buffer, " ", sTimeInfoData->dataLength));
    NRF_LOG_FLUSH();
    NRF_LOG_DEBUG("Current Epoch time %llu", (getRtcTicks() + epoch));
}

static void ghscp_handler(unsigned char *cmd, unsigned short len);
static void racp_handler(unsigned char *cmd, unsigned short len);
static void handleSetTime(unsigned char *setTime);

static bool do_read_request(ble_evt_t * p_ble_evt)
{
    NRF_LOG_DEBUG("Read write authorized request signaled\r\n");
    ble_gatts_evt_rw_authorize_request_t auth = p_ble_evt->evt.gatts_evt.params.authorize_request;
    if (auth.type == BLE_GATTS_AUTHORIZE_TYPE_READ)
    {
        NRF_LOG_DEBUG("Characteristic %04X read at time %u\r\n", auth.request.read.uuid.uuid, getTicks());
        ble_gatts_rw_authorize_reply_params_t p_rw_authorize_reply_params;
        p_rw_authorize_reply_params.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
        p_rw_authorize_reply_params.params.read.offset = 0;
        p_rw_authorize_reply_params.params.read.gatt_status = NRF_SUCCESS;
        p_rw_authorize_reply_params.params.read.update = 1;
        switch (auth.request.read.uuid.uuid)
        {
        case BTLE_DIS_SYSTEM_ID_CHAR:
            p_rw_authorize_reply_params.params.read.p_data = systemInfo->systemId;
            p_rw_authorize_reply_params.params.read.len = 8;
            break;
        case BTLE_DIS_MODEL_NUMBER_CHAR:
            loadString(systemInfo->modelNumber, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->modelNumber);
            break;
        case BTLE_DIS_SERIAL_NUMBER_CHAR:
            loadString(systemInfo->serialNo, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->serialNo);
            break;
        case BTLE_DIS_FIRMWARE_REVISION_CHAR:
            loadString(systemInfo->firmware, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->firmware);
            break;
        case BTLE_DIS_HARDWARE_REVISION_CHAR:
            loadString(systemInfo->hardware, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->hardware);
            break;
        case BTLE_DIS_SOFTWARE_REVISION_CHAR:
            loadString(systemInfo->software, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->software);
            break;
        case BTLE_DIS_MANUFACTURER_DEVICE_NAME_CHAR:
            loadString(systemInfo->manufacturer, (uint8_t *)p_rw_authorize_reply_params.params.read.p_data, 0);
            p_rw_authorize_reply_params.params.read.len = (uint16_t)strlen(systemInfo->manufacturer);
            break;
        case BTLE_DIS_REG_CERT_DATA_LIST_CHAR:
            p_rw_authorize_reply_params.params.read.p_data = systemInfo->regCertDataList;
            p_rw_authorize_reply_params.params.read.len = systemInfo->regCertDataListLength;
            break;

        case BTLE_BATTERY_LEVEL_CHAR:
            p_rw_authorize_reply_params.params.read.p_data = &batteryCharValue;
            batteryCharValue--;
            p_rw_authorize_reply_params.params.read.len = 1;
            break;

        case BTLE_CLOCK_INFO_CHAR:
            getCurrentTime();
           // memcpy((unsigned char *)p_rw_authorize_reply_params.params.read.p_data, &sTimeInfoData->timeInfoBuf[2], sTimeInfoData->dataLength - 2); // Send everything but command header
            p_rw_authorize_reply_params.params.read.p_data = sTimeInfoData->timeInfoBuf;
            p_rw_authorize_reply_params.params.read.len = sTimeInfoData->dataLength;
            //NRF_LOG_DEBUG("Enabling live data due to read request at time %u\n", getTicks()); - Now done by control point
            //send_live_data = true;
            break;

        default:
            return false;
        }
        uint32_t response = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &p_rw_authorize_reply_params);
        NRF_LOG_DEBUG("Read update reply response %u\r\n", response);
        return true;
    }
    else if (auth.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) // Really dont need this to trap writes
    {
        NRF_LOG_DEBUG("Write authorized request at time %u\n", getTicks());
        uint32_t err_code;
        ble_gatts_rw_authorize_reply_params_t reply;
        memset(&reply, 0, sizeof(ble_gatts_rw_authorize_reply_params_t));
        // Command from RACP control point
        if (p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.handle == m_racp_handle.value_handle)
        {
            if (cccdSet[RACP_CCCD_INDEX])
            {
                reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                reply.params.write.update = 1;
                reply.params.write.len = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len;
                reply.params.write.p_data = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data;
                err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &reply);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("RW RACP reply gave error %u:\r\n", err_code);
                }
                current_char_handle = m_racp_handle.value_handle;
                racp_handler(p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data, 
                                p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len);
                return true;
            }
            else
            {
                reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_CPS_CCCD_CONFIG_ERROR;
            }
        }
        // Command from GHS Control Point
        else if (p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.handle == m_ghs_bt_sig_cp_handle.value_handle)
        {
            if (cccdSet[GHS_CP_CCCD_INDEX])
            {
                reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                reply.params.write.update = 1;
                reply.params.write.len = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len;
                reply.params.write.p_data = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data;
                current_char_handle = m_ghs_bt_sig_cp_handle.value_handle;
                err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &reply);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("RW GHS CP reply gave error %u:\r\n", err_code);
                }
                ghscp_handler(p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data, 
                    p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len);
                return true;
            }
            else
            {
                reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_CPS_CCCD_CONFIG_ERROR;
            }
        }
        // Setting the time on the Simple Time characteristic
        else if (p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.handle == m_clock_info_handle.value_handle)
        {
            unsigned char req_flags = (p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data[GHS_TIME_INDEX_FLAGS] & 0xDF);  // Need to ignore the on current timeline setting
            unsigned char ghs_flags = (sTimeInfoData->timeInfoBuf[GHS_TIME_INDEX_FLAGS] & 0xDF);
            unsigned char req_offset = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data[GHS_TIME_INDEX_OFFSET];
            unsigned char ghs_offset = sTimeInfoData->timeInfoBuf[GHS_TIME_INDEX_OFFSET];
            if ((req_flags == ghs_flags) && ((ghs_offset == 0x80 && req_offset == 0x80) || (ghs_offset != 0x80 && req_offset != 0x80)))
            {
                unsigned char req_sync = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data[GHS_TIME_INDEX_TIME_SYNC];
                unsigned char ghs_sync = sTimeInfoData->timeInfoBuf[GHS_TIME_INDEX_TIME_SYNC];
                if ((ghs_sync == INFRA_MDC_TIME_SYNC_NONE || ghs_sync == INFRA_MDC_TIME_SYNC_EBWW) ||   // If we are not synced or set by a user, accept all incomings
                    (req_sync != INFRA_MDC_TIME_SYNC_EBWW && req_sync != INFRA_MDC_TIME_SYNC_OTHER))    // If we are something else and incoming is not UI or other, accept
                {
                    NRF_LOG_DEBUG("PHG setting the time on the Clock Info at time %u", getTicks());
                    reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                    reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    reply.params.write.update = 1;
                    reply.params.write.len = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len;
                    reply.params.write.p_data = p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data;
                    current_char_handle = m_clock_info_handle.value_handle;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &reply);
                    if (err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("RW SetTime char write reply gave error %u:", err_code);
                    }
                    handleSetTime(p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data);
                    return true;
                }
                else
                {
                    NRF_LOG_WARNING("Client set time has too poor of a synchronization. ghs sync: %u  req sync: %u  Not setting time.", ghs_sync, req_sync);
                    reply.params.write.gatt_status = GHS_TIME_ERROR_TIME_SYNC_TOO_POOR;
                }
            }
            else
            {
                NRF_LOG_ERROR("Client set time has incorrect flags or offset format. ghs flags: 0x%02X, request flags: 0x%02X  ghs offset: 0x%02X, request offset: 0x%02X",
                             ghs_flags, req_flags, ghs_offset, req_offset);
                reply.params.write.gatt_status = GHS_TIME_ERROR_INCORRECT_FORMAT;
            }
        }
        err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &reply);
        return true;
    }
    else
    {
        NRF_LOG_DEBUG("Received an authorized RW request at time %u with type %u\r\n", getTicks(), auth.type);
    }
    return false;
}

