brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
        // Set up parameters for notification of this PDU - likely in fragments
        global_send.chunks_outstanding = 0;
        global_send.handle = current_char_handle;
        global_send.offset = 0;
        global_send.data_length = (unsigned short)msmtGroupData->dataLength;
        global_send.recordNumber = recordNumber;
        return true;
    }
    return false;
}

/**
  This 
 */
void sendStoredMeasurements(unsigned short stored_count)
{
    if (m_connection_handle != BLE_CONN_HANDLE_INVALID && cccdSet[STORED_DATA_CCCD_INDEX] && !live_data_mode)
    {
        sendStoredSpecializationMsmts(stored_count);
        bsp_board_led_on(MSMT_DATA_LED);
    }
}

static bool encodeMsmtData(void *data)
{
    if (global_send.handle != 0)
    {
        if (!ghs_abort)
        {
            emptyQueue(queue);
        }
        NRF_LOG_DEBUG("Not ready for measurement # %lu\r\n", live_data_count);
        return false;
    }
    if (send_flag)
    {
        NRF_LOG_DEBUG("Not ready for live measurement # %lu\r\n, still sending", live_data_count);
        return false;
    }
    return encodeSpecializationMsmts((s_MsmtData *)data);
}

/*
 * For live data I have a timer that triggers a call to this method every GHS_LIVE_DELAY.
 * Fake measurements are generated based upon the current time tick in some manner. May not be the
 * greatest approach since the time interval is often a nice even one so one gets the same measurement.
 * That's a minor problem. This is called repeatedly but only generates measurements after the 
 * PHG has enabled the live data characteristic.
 */
 #if (USES_LIVE_DATA == 1)
static void live_data_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    if (live_data_mode && !ghs_abort)
    {
        live_data_count++;
        unsigned long timeStamp32 = getTicks();
        NRF_LOG_DEBUG("live data generator called at timestamp32 %lu\r\n", timeStamp32);
        if (isFull(queue))
        {
            NRF_LOG_DEBUG("Queue full - Not ready for measurement %lu at time %lu\r\n", live_data_count, timeStamp32);
            return;
        }
        #if (USE_DK == 0)
        {
            if (live_data_count > LIVE_COUNT_MAX)
            {
                NRF_LOG_DEBUG("Sending disconnect\r\n");
                ghs_abort = false;
                app_timer_start(m_ghs_disconnect_timer_id, GHS_COMMAND_DELAY, NULL);
         //       start_shutdown = true;
         //       done_timer = getTicks();
         //       app_timer_stop(m_ghs_live_data_timer_id);
         //       createRacpResponse(SENSOR_DONE, 2);
         //       send_flag = true;
                return;
            }
        }
        #endif
        generateLiveDataForSpecializations(live_data_count, getRtcTicks(), timeStamp32);
        bsp_board_led_on(MSMT_DATA_LED);
    }
}
#endif

/**
  Command handler. This method is called when the PHG writes a command on the GHS control point.
 */

static void printCommand(char *str, unsigned short cmd)
{
    NRF_LOG_INFO("====> Received %s (%u) command at time %u.\r\n", (uint32_t)str, cmd, getTicks());
}

static void printCommandErr(char *str, unsigned short cmd, char *err)
{
    NRF_LOG_INFO("====> %s (%u) command received at time %u %s.\r\n", (uint32_t)str, cmd, getTicks(), (uint32_t)err);
}

static void ghscp_handler(unsigned char *cmd, unsigned short len)
{
    global_send.chunk_size = (MAX_CHAR_LEN - OPCODE_LENGTH - HANDLE_LENGTH); // revert back to data_length. NO!! This can be set longer in cases where mtu_size can't
                                                                                 // the data length update is done in event BLE_GAP_EVT_DATA_LENGTH_UPDATE. Don't know if it
                                                                                 // affects this.
    char *str = "";
    switch (cmd[0])
    {
        case GHSCP_SET_LIVE_DATA_MODE:
        case GHSCP_CLEAR_LIVE_DATA_MODE:
            str = (cmd[0] == GHSCP_SET_LIVE_DATA_MODE) ? "set live data mode" : "clear live data mode";

            if (!racp_mode)                 // If we are NOT doing an RACP procedure
            {
                printCommand(str, global_send.current_command);
                createCpResponse(GHSCP_RSP_SUCCESS, 1);       // Indicate a success response
                current_char_handle = m_ghs_bt_sig_live_data_not_handle.value_handle;  // NEEDED FOR THE SEND_DATA method!!

                live_data_mode = (cmd[0] == GHSCP_SET_LIVE_DATA_MODE);       // Set/Clear our internal live data mode flag
            }
            else
            {
                printCommandErr(str, global_send.current_command, "rejected since busy with RACP");
                createCpResponse(GHSCP_RSP_BUSY, 1);
            }

            send_flag = true;
            break;
            
        default:
            str = "unknown GHS CP command";
            printCommand(str, global_send.current_command);
            createCpResponse(GHSCP_RSP_UNKNOWN_COMMAND, 1);
            send_flag = true;
            break;
    }

}

static void racp_handler(unsigned char *cmd, unsigned short len)
{
    //global_send.chunk_size = (data_length - 4 - OPCODE_LENGTH - HANDLE_LENGTH); // revert back to data_length. This can be set longer in cases where mtu_size can't
    //                                                                            // the data length update is done in event BLE_GAP_EVT_DATA_LENGTH_UPDATE
    global_send.current_command = cmd[0] + (cmd[1] << 8);  // We made need to include cmd[2]
    char *str = NULL;
    switch (cmd[0])
    {
        case RACP_GET_NUM_OF_RECORDS:       // Get number of records command
            #if (USES_STORED_DATA == 0)
                RESP_OPER_UNSUPPORTED[2] = cmd[0];
                createRacpResponse(RESP_OPER_UNSUPPORTED, 4);
                send_flag = true;
                return;
            #else
            switch (cmd[1])
            {
                case RACP_ALL:
                {
                    str = "get Number of all Records";
                    printCommand(str, global_send.current_command);
                    NRF_LOG_INFO("Number of all records is %u\r\n", numberOfStoredMsmtGroups);

