brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
                    GET_NUMBER_OF_RECORDS_RESP_SUCCESS[2] = (numberOfStoredMsmtGroups & 0xFF);
                    GET_NUMBER_OF_RECORDS_RESP_SUCCESS[3] = ((numberOfStoredMsmtGroups >> 8) & 0xFF);
                    createRacpResponse(GET_NUMBER_OF_RECORDS_RESP_SUCCESS, 4);

                    send_flag = true;
                }
                break;
                
                case RACP_GTE:
                {
                    unsigned short numberOfRecords = getNumberOfStoredRecords(cmd, len);
                    str = (cmd[2] == RACP_RECORD_NUM) ? "get Number of Records >= record number" :
                                                            "get Number of Records >= timestamp";
                    global_send.current_command = global_send.current_command + (cmd[2] << 16);
                    printCommand(str, global_send.current_command);
                    
                    NRF_LOG_INFO("Number of records is %u\r\n", numberOfRecords);

                    GET_NUMBER_OF_RECORDS_RESP_SUCCESS[2] = (numberOfRecords & 0xFF);
                    GET_NUMBER_OF_RECORDS_RESP_SUCCESS[3] = ((numberOfRecords >> 8) & 0xFF);
                    createRacpResponse(GET_NUMBER_OF_RECORDS_RESP_SUCCESS, 4);
                    send_flag = true;
                }
                break;
            }
            break;
            #endif
    
    case RACP_GET_RECORDS:
    case RACP_GET_COMBINED:
    {
        NRF_LOG_DEBUG("----> Get records request received\r\n");
        #if (USES_STORED_DATA == 0)
            RESP_OPER_UNSUPPORTED[2] = cmd[0];
            createRacpResponse(RESP_OPER_UNSUPPORTED, 4);
            send_flag = true;
            return;
        #else
        if (!live_data_mode && cccdSet[STORED_DATA_CCCD_INDEX])  // If not in live data mode and stored data char enabled
        {
            bool combined = (cmd[0] == RACP_GET_COMBINED);
            num_records_to_send = getNumberOfStoredRecords(cmd, len);
            long start_index = getStartIndexInStoredRecords(cmd, len);
            NRF_LOG_DEBUG("----> Number of records to send %u Start index %u\r\n", num_records_to_send, start_index);
            switch(cmd[1])
            {
                case RACP_ALL:
                    str = "get all records";
                case RACP_FIRST:
                    str = (str != NULL) ? str : "get first record";
                case RACP_LAST:
                    str = (str != NULL) ? str : "get last record";
                case RACP_GTE:
                    if (str == NULL)
                    {
                        if (cmd[2] == RACP_RECORD_NUM)
                        {
                            str = (str != NULL) ? str : "get records GTE to record num";
                        }
                        else if (cmd[2] == RACP_TIMESTAMP)
                        {
                            str = (str != NULL) ? str : "get records GTE to time stamp";
                        }
                        global_send.current_command = global_send.current_command + (cmd[2] << 16);
                    }
                    str = (str != NULL) ? str : "get records GTE to timestamp";
                    racp_request = cmd[0];
                    stored_data_done_sent = false;
                    printCommand(str, global_send.current_command);
                    if (start_index >= 0)
                    {
                        racp_mode = true;
                        NRF_LOG_DEBUG("----> Sending stored data element %u\r\n", start_index);
                        global_send.number_of_groups = num_records_to_send;
                        current_char_handle = m_ghs_bt_sig_stored_data_not_handle.value_handle;   // NEEDED FOR THE SEND_DATA method!!
                        sendStoredMeasurements(start_index);
                    }
                    else if (num_records_to_send == 0)
                    {
                        RESP_NO_RECORDS[2] = cmd[1];
                        createRacpResponse(RESP_NO_RECORDS, 4);
                        send_flag = true;
                    }
                    break;
                default:
                    RESP_OPER_UNSUPPORTED[2] = cmd[0];
                    createRacpResponse(RESP_OPER_UNSUPPORTED, 4);
                    send_flag = true;
                    break;
            }
        }
        else
        {
            RESP_NO_RECORDS[2] = cmd[0];
            createRacpResponse(RESP_SERVER_BUSY, 4);
            send_flag = true;
        }
        break;
        #endif
    }

    case RACP_DELETE_RECORDS:
        #if (USES_STORED_DATA == 0)
            RESP_OPER_UNSUPPORTED[2] = cmd[0];
            createRacpResponse(RESP_OPER_UNSUPPORTED, 4);
            send_flag = true;
            return;
        #else
        if (cccdSet[RACP_CCCD_INDEX])
        {
            str = "Delete All Stored Records";
            if (!live_data_mode)
            {
                deleteStoredSpecializationMsmts();  // really don't need this, setting numberOfStoredMsmtGroups to 0 will do it.
                numberOfStoredMsmtGroups = 0;
                recordNumber = 0;
                // Respond with command done
                printCommand(str, global_send.current_command);
                createRacpResponse(DELETE_RECORDS_RESP_SUCCESS, 4);
                send_flag = true;
            }
            else
            {
                printCommandErr(str, global_send.current_command, "rejected since busy");
                RESP_NO_RECORDS[2] = cmd[0];
                createRacpResponse(RESP_SERVER_BUSY, 4);
                send_flag = true;
            }
        }
        break;
        #endif

    default:
        str = "an unsupported";
        printCommandErr(str, global_send.current_command, "is unsupported");
        // Respond with command done
        RESP_OPCODE_UNSUPPORTED[2] = cmd[0];
        createRacpResponse(RESP_OPCODE_UNSUPPORTED, 4);
        send_flag = true;
    }
}

static void handleSetTime(unsigned char *setTime)
{
    #if (USES_TIMESTAMP == 1)
        unsigned short i;
        unsigned char oldTime[TIME_STAMP_LENGTH];
        unsigned char newTime[TIME_STAMP_LENGTH];
        unsigned long long oldTimeVal = 0ULL;
        unsigned long long newTimeVal = 0ULL;
        long long diff = 0LL;
        long long oldEpoch = epoch;
        unsigned short timeSync;
        char printBuf[64];
        getCurrentTime();
        memcpy(oldTime, &sTimeInfoData->timeInfoBuf[sTimeInfoData->currentTime_index], TIME_STAMP_LENGTH); // destination, source, length
        memcpy(newTime, setTime, TIME_STAMP_LENGTH);
        // check that formats are good
        memset(printBuf, 0, 64);
        NRF_LOG_INFO("Set Time received: %s\r\n", (uint32_t)byteToHex(newTime, printBuf, " ", TIME_STAMP_LENGTH));
        NRF_LOG_FLUSH();
        updateCurrentTimeFromSetTime(&sTimeInfoData, newTime);
        NRF_LOG_INFO("New current time: %s\r\n", (uint32_t)byteToHex(sTimeInfoData->timeInfoBuf, printBuf, " ", TIME_STAMP_LENGTH));
        NRF_LOG_FLUSH();
        for (i = 0; i < 6; i++)
        {
             oldTimeVal = (oldTimeVal << 8) + (((unsigned long long)oldTime[5 - i + GHS_TIME_INDEX_EPOCH]) & 0xFF);  // epoch is located after a 1-byte flag
             newTimeVal = (newTimeVal << 8) + (((unsigned long long)newTime[5 - i + GHS_TIME_INDEX_EPOCH]) & 0xFF);
        }
        diff = newTimeVal - oldTimeVal;
        epoch = epoch + diff; // Adjust start epoch by difference too. This allows us to get new time by adding current ticks to new start epoch
                                                             // How to add an unsigned int to a signed int
        NRF_LOG_DEBUG("old time: %llx  new time: %llx diff %llx  old epoch: %llx, new epoch: %llx\r\n", oldTimeVal, newTimeVal, diff, oldEpoch, epoch);
    //     NRF_LOG_DEBUG("New base epoch: %d ", epoch/1000);
        timeSync = (((unsigned short) newTime[GHS_TIME_INDEX_TIME_SYNC]) & 0xFF);
        sGhsTime->timeSync = timeSync;      // Update the time sync of our 'base' current time
        // Handles date-time adjustments and updating the time sync in the group data array msmt time stamps
        handleSpecializationsOnSetTime(numberOfStoredMsmtGroups, diff, timeSync);
    #endif
}
/*
static bool handleCommonEvents(ble_evt_t* p_ble_evt)
{
    uint32_t err_code;
    bool used = false;   // just indicates an event was handled when set to true

    switch (p_ble_evt->header.evt_id)
    {

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            mtu_size = p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
            NRF_LOG_DEBUG("New MTU size requested %d\r\n", mtu_size);
            if (mtu_size > NRF_SDH_BLE_GATT_MAX_MTU_SIZE)   // Set in sdk_config.h
            {
                mtu_size = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
                NRF_LOG_DEBUG("Requested MTU size exceeds maximum; reset to maximum size of %d\r\n", mtu_size);
            }
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle, mtu_size);

            if (err_code != NRF_SUCCESS)
            {
                mtu_size = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
                NRF_LOG_DEBUG("MTU exchange request reply failed. Error code: 0x%02X\r\n", err_code);
            }
            global_send.chunk_size = (mtu_size - OPCODE_LENGTH - HANDLE_LENGTH);
            used = true;
            break;

        #if defined(S140) || defined (S113)
            case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
            {
                ble_gap_data_length_limitation_t limitation;
                ble_gap_data_length_params_t server;
                NRF_LOG_DEBUG("Data length update request: max_rx_octets %d, max_rx_time %d, "
                    "max_tx_octets %d, max_tx_time %d\r\n",
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_time_us,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_time_us);
                unsigned short tx_size = p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets;
                server.max_rx_octets = p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets;
                server.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                server.max_tx_octets = (tx_size < NRF_SDH_BLE_GAP_DATA_LENGTH) ? tx_size : NRF_SDH_BLE_GAP_DATA_LENGTH;  // Set in sdk_config.h
                server.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                uint32_t result = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &server, &limitation);
                NRF_LOG_DEBUG("sd_ble_gap_data_length_update Result %d\r\n", result);
                if (result != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("RX limit %d  tx limit %d\r\n", limitation.rx_payload_limited_octets, limitation.tx_payload_limited_octets);
                }
                used = true;
            }
            break;

            case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
            {
                NRF_LOG_DEBUG("Data length update: max_rx_octets %d, max_rx_time %d, "
                    "max_tx_octets %d, max_tx_time %d\r\n",
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us);
                data_length = p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets;
            }
            used = true;
            break;
        #endif

