brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
        case BLE_GAP_EVT_TIMEOUT:
            NRF_LOG_DEBUG("Advertisement timed out at time %u\r\n", getTicks());
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            NRF_LOG_DEBUG("Saved info being requested at time %u\r\n", getTicks());
            err_code = sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gap_evt.conn_handle, saveDataBuffer,
                saveDataLength, BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
            if (err_code != NRF_SUCCESS)
            {
                if (saveDataBuffer != NULL)
                {
                    free (saveDataBuffer);
                    saveDataBuffer = NULL;
                    saveDataLength = 0;
                }
                NRF_LOG_DEBUG("Failed updating persistent sys attr info. Error code: 0x%02X\r\n", err_code);
            }
            break;

        /*  Pairing - encryption sequence:
         *  If not paired:
         *      BLE_GAP_EVT_SEC_PARAMS_REQUEST
         *      BLE_GAP_EVT_CONN_SEC_UPDATE
         *      BLE_GAP_EVT_AUTH_STATUS
         *  If paired:
         *      BLE_GAP_EVT_SEC_INFO_REQUEST
         *      BLE_GAP_EVT_CONN_SEC_UPDATE
         */

        // Pairing request from the PHG
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            if (pairing > 0)
            {
                bsp_board_led_on(BSP_BOARD_BUTTON_3);
                NRF_LOG_INFO("Pairing requested\r\n");
                if (keys.keys_own.p_enc_key->enc_info.ltk_len != 0)     // Pairing request from a different PHG or PHG lost its bonding info.
                {
                    NRF_LOG_DEBUG("GHS is paired with some device but not the one that has connected!\r\n");
                    if (saveDataBuffer != NULL)
                    {
                        free (saveDataBuffer);
                        saveDataLength = 0;
                        saveDataBuffer = NULL;
                    }
                }
                memcpy(&peer_sec_params, &p_ble_evt->evt.gap_evt.params.sec_params_request.peer_params, sizeof(ble_gap_sec_params_t));  // destination, source, length
                err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_SUCCESS, &own_sec_params, &keys);
                APP_ERROR_CHECK(err_code);
            }
            else
            {
                NRF_LOG_DEBUG("Sending pairing not supported!\r\n");
                err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
                APP_ERROR_CHECK(err_code);
            }
            break;

        // Encryption has been established
        case BLE_GAP_EVT_CONN_SEC_UPDATE:
        {
            NRF_LOG_INFO("Encryption established\r\n");
            hasEncrypted = true;
        }
        break;

        /* This event is signaled when pairing has completed. All the key information is
         * placed in the 'keys' struct passed into the sd_ble_gap_sec_params_reply() method.
         * The next event to be signaled will be encryption.
         * If already paired, this event will not be signaled
         */
        case BLE_GAP_EVT_AUTH_STATUS:
        {
            bsp_board_led_off(BSP_BOARD_BUTTON_3);
            NRF_LOG_INFO("Pairing completed\r\n");
        }
        break;
        
        // For requesting pass keys - should not happen here.
        case BLE_GAP_EVT_AUTH_KEY_REQUEST:

            err_code = sd_ble_gap_auth_key_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
            break;

        /* This event is signaled when encryption is being requested. Should only happen on a bonded reconnect. 
         * Here the keys that are needed are those of the peripheral. The keys of the slave device are used */
        case BLE_GAP_EVT_SEC_INFO_REQUEST:
        {
            NRF_LOG_INFO("Encryption request received\r\n");
            flash_write_needed = false; // We already have our data.
            ble_gap_evt_sec_info_request_t sec_info = p_ble_evt->evt.gap_evt.params.sec_info_request;
            ble_gap_enc_info_t* enc_info = NULL;
            ble_gap_irk_t* irk_info = NULL;

            if (sec_info.enc_info) // Set if peer is asked for the encryption info
            {
                enc_info = &keys.keys_own.p_enc_key->enc_info; // Keys created by the peripheral are used
            }
            if (sec_info.id_info) // Set if peer is asking for the IRK
            {
                irk_info = &keys.keys_own.p_id_key->id_info;
            }
            err_code = sd_ble_gap_sec_info_reply(p_ble_evt->evt.gap_evt.conn_handle, enc_info, irk_info, NULL);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("PAIRING INCONSISTENCY!! Client thinks it is paired with us but we have lost that pairing data. Error code: 0x%02X\r\n", err_code);
            }
        }
        break;


        case BLE_GATTS_EVT_HVC:
            global_send.chunks_outstanding--;                   // We don't need to do this - plays no role for indications
            if (global_send.offset >= global_send.data_length)  // Have all segments been indicated?
            {
                NRF_LOG_INFO("----> Indications complete at time %u, connection handle 0x%04X\r\n", getTicks(), m_connection_handle);
                global_send.data_length = 0;
                global_send.offset = 0;
                if (global_send.handle == m_ghs_bt_sig_stored_data_not_handle.value_handle ||
                    global_send.handle == m_ghs_bt_sig_live_data_not_handle.value_handle)      // Notification was for response char
                {
                    handle_data_characteristics();
                    break;
                }
                global_send.handle = 0;
                if (global_send.current_command == GHSCP_SET_LIVE_DATA_MODE) // If this is a record done confirmation for live data
                {
                    global_send.data_length = 0;
                }
                else if (((global_send.current_command & 0xFF) == RACP_GET_RECORDS) ||
                         ((global_send.current_command & 0xFF) == RACP_GET_COMBINED))
                {
                    NRF_LOG_INFO("----> All stored data sent indication has been acknowledged\r\n");
                    racp_mode = false;
                }
                break;
            }
            else
            {
                NRF_LOG_DEBUG("----> Indication of hunk complete at time %u, connection handle 0x%04X\r\n", getTicks(), m_connection_handle);
                send_flag = true;
            }
            break;

        // By the time this is signaled, the write response has already been sent - so one is free to do whatever.
        case BLE_GATTS_EVT_WRITE:
            // Enable Indication on RACP
            if (p_ble_evt->evt.gatts_evt.params.write.handle == m_racp_handle.cccd_handle)
            {
                uint8_t write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
                cccdSet[RACP_CCCD_INDEX] = (write_data == BLE_GATT_HVX_INDICATION);
                NRF_LOG_INFO("Enabling RACP CCCD with %d at time %u\r\n", write_data, getTicks());
            }
            // Enable Indication on GHS CP
            else if (p_ble_evt->evt.gatts_evt.params.write.handle == m_ghs_bt_sig_cp_handle.cccd_handle)
            {
                uint8_t write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
                cccdSet[GHS_CP_CCCD_INDEX] = (write_data == BLE_GATT_HVX_INDICATION);
                NRF_LOG_INFO("Enabling GHS CP CCCD with %d at time %u\r\n", write_data, getTicks());
            }
            // Enable Notification or indication Stored data (if PHG sends both, pick indication)
            else if (p_ble_evt->evt.gatts_evt.params.write.handle == m_ghs_bt_sig_stored_data_not_handle.cccd_handle)
            {
                uint8_t write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
                cccdSet[STORED_DATA_CCCD_INDEX] = (write_data == 3) ? BLE_GATT_HVX_INDICATION : (write_data & 3);
                NRF_LOG_INFO("Enabling GHS Bt Sig stored data CCCD with %d at time %u\r\n", write_data, getTicks());
            }
            // Enable Notification or Indication Live data (if PHG sends both, pick indication)
            else if (p_ble_evt->evt.gatts_evt.params.write.handle == m_ghs_bt_sig_live_data_not_handle.cccd_handle)
            {
                uint8_t write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
                cccdSet[LIVE_DATA_CCCD_INDEX] = (write_data == 3) ? BLE_GATT_HVX_INDICATION : (write_data & 3);
                NRF_LOG_INFO("Enabling GHS Bt Sig live data CCCD with %d at time %u\r\n", write_data, getTicks());
            }
            // Setting the time on the Simple Time characteristic
         //   else if(p_ble_evt->evt.gatts_evt.params.write.handle == m_clock_info_handle.value_handle)
         //   {
         //       NRF_LOG_DEBUG("PHG setting the time on the Clock Info at time %u\r\n", getTicks());
         //       handleSetTime(p_ble_evt->evt.gatts_evt.params.write.data);
         //   }
            break;

        // Turns out for notifications one sends in a loop and you may get one event per N packets. Could be one event per notification
        // or one event per N notifications. So I need to keep track of outstanding events. global_send.chunks_outstanding is incremented
        // every notification, and decremented by p_ble_evt->evt.common_evt.params.tx_complete.count every event. When 0, the notification
        // sequence is done.
        case BLE_EVT_TX_COMPLETE:  // This is the best we get for notifications
            global_send.chunks_outstanding = global_send.chunks_outstanding - p_ble_evt->evt.common_evt.params.tx_complete.count;
            NRF_LOG_INFO("----> Notification TX done event received. Packets sent and not evented %u\r\n", global_send.chunks_outstanding);
            if (global_send.chunks_outstanding > 0) // Have not received all events from notifications
            {
                if (global_send.offset < global_send.data_length)
                {
                    send_flag = true;
                }
                break;
            }
            if (global_send.offset >= global_send.data_length && global_send.offset > 0)  // Have all segments been notified?
            {   // If yes:
                NRF_LOG_INFO("----> Notification(s) complete at time %u, connection handle 0x%04X\r\n", getTicks(), m_connection_handle);
                global_send.data_length = 0;
                global_send.offset = 0;
                if (global_send.handle == m_ghs_bt_sig_stored_data_not_handle.value_handle ||
                    global_send.handle == m_ghs_bt_sig_live_data_not_handle.value_handle)      // Notification was for response char
                {
                    handle_data_characteristics();
                }
                break;
            }
            else
            {
                NRF_LOG_DEBUG("----> Notification of hunk complete at time %u, connection handle 0x%04X\r\n", getTicks(), m_connection_handle);
                send_flag = true;
            }
            break;


        default:
            if (on_generic_ble_evt(p_ble_evt))
            {
                break;
            }
           // if (handleCommonEvents(p_ble_evt)) break;
            NRF_LOG_DEBUG("Unhandled Event %d at time %u\r\n", p_ble_evt->header.evt_id, getTicks());
            break;
        }
}

static void write_flash(void * p_context)
{
    saveKeysToFlash(&keys, &saveDataBuffer, &saveDataLength, cccdSet, &noOfCccds);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in] sys_evt  System stack event.
 */
/*
static void sys_evt_dispatch(uint32_t sys_evt)
{
    // Dispatch the system event to the fstorage module, where it will be
    // dispatched to the Flash Data Storage (FDS) module.
    // fs_sys_event_handler(sys_evt);

