brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
    // Dispatch to the Advertising module last, since it will check if there are any
    // pending flash operations in fstorage. Let fstorage process system events first,
    // so that it can report correctly to the Advertising module.
    // ble_advertising_on_sys_evt(sys_evt);
}
*/

#define RAM_START       0x20000000
static uint32_t ram_end_address_get(void)
{
    uint32_t ram_total_size;

#ifdef NRF51
    uint32_t block_size = NRF_FICR->SIZERAMBLOCKS;
    ram_total_size      = block_size * NRF_FICR->NUMRAMBLOCK;
#else
    ram_total_size      = NRF_FICR->INFO.RAM * 1024;
#endif

    return RAM_START + ram_total_size;
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);
    
    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);
/*
    uint32_t const app_ram_start_link = ram_start;
    err_code = sd_ble_enable(&ram_start); // This can change the ram start I guess.
    if (ram_start > app_ram_start_link)
    {
        NRF_LOG_WARNING("Insufficient RAM allocated for the SoftDevice.\r\n");

        NRF_LOG_WARNING("Change the RAM start location from 0x%x to 0x%x.\r\n",
                        app_ram_start_link, ram_start);
        NRF_LOG_WARNING("Maximum RAM size for application is 0x%x.\r\n",
                        ram_end_address_get() - (ram_start));
    }
    else
    {
        NRF_LOG_DEBUG("RAM starts at 0x%x\r\n", app_ram_start_link);
        if (ram_start != app_ram_start_link)
        {
            NRF_LOG_DEBUG("RAM start location can be adjusted to 0x%x.\r\n", ram_start);

            NRF_LOG_DEBUG("RAM size for application can be adjusted to 0x%x.\r\n",
                          ram_end_address_get() - (ram_start));
        }
    }
*/
    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
}

// Not sure what this used for
static void gpiote_init_new(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}

// This method is called only once after the final measurement is received from the
// sensor module. At this point we start advertising, connect and send the obtained 
// final measurements
static void bring_up_adver(void)
{
    if (m_connection_handle  == BLE_CONN_HANDLE_INVALID)  // Should always be invalid
    {
        emptyQueue(queue);
        // We auto-add a stored msmt when there is no button push
        #if (USE_DK == 0)
            numberOfStoredMsmtGroups = 0;
            generateAndAddStoredMsmt(getRtcTicks(), getTicks(), numberOfStoredMsmtGroups);
            numberOfStoredMsmtGroups++;
            NRF_LOG_DEBUG("Waiting 4 seconds before restarting advertisments\r\n");
            nrf_delay_ms(4000); // Give us a chance to exit PHG
        #endif
        live_data_mode = false;
        racp_mode = false;
        live_data_count = 0;
        global_send.recordNumber = 0;
        hasEncrypted = (pairing > 0) ? false : true;   // If pairing is not supported, set to true
        ghs_abort = false;
//        start_shutdown = false;
        flash_write_needed = true;
        bsp_board_led_on(ADVERTISING_LED);
        #if (USES_LIVE_DATA == 1)
            app_timer_start(m_ghs_live_data_timer_id, GHS_LIVE_DELAY, NULL); // If already running this call does nothing
        #endif
        advertising_start();
    }
}

/*
static void receive_new_measurement(uint8_t * p_data)
{
    uint8_t     pulse;
    uint8_t     spo;
    unsigned long dev_status;
}
*/

#if (USE_DK == 1)
    /*  We only use on the DK in place of no real sensor. To use this code we have to
        bring back the Board Support files into the project. */
    static void bsp_event_handler(bsp_event_t event)
    {
        switch (event)
        {
            case BSP_EVENT_SLEEP:
                break;

            case BSP_EVENT_KEY_3:
            {
                #if (USES_STORED_DATA == 1 && USES_TIMESTAMP == 1)
                    if ( numberOfStoredMsmtGroups >= NUMBER_OF_STORED_MSMTS)
                    {
                        NRF_LOG_DEBUG("Stored data buffer full, skipping\r\n");
                        return;
                    }
                    NRF_LOG_DEBUG("Stored data generator called at timestamp32 %lu\r\n", getTicks());
                    generateAndAddStoredMsmt(getRtcTicks(), getTicks(), numberOfStoredMsmtGroups);
                    numberOfStoredMsmtGroups++;
                #endif
            }
            break;

            case BSP_EVENT_KEY_1:
                NRF_LOG_DEBUG("Sending disconnect\r\n");
                ghs_abort = false;
                app_timer_start(m_ghs_disconnect_timer_id, GHS_COMMAND_DELAY, NULL);
              //  start_shutdown = true;
              //  done_timer = getTicks();
             //   app_timer_stop(m_ghs_live_data_timer_id);
             //   createRacpResponse(SENSOR_DONE, 2);
                //send_flag = true;
                break;

            case BSP_EVENT_KEY_2:
            {
                NRF_LOG_DEBUG("Button press done to start advertising\r\n");
                bring_up_adver();
            }
            break;

            default:
                break;
        }
    }

    static void buttons_leds_init(void)
    {
        bsp_event_t startup_event;

        
        uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);

        APP_ERROR_CHECK(err_code);

        err_code = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(err_code);
    }
#else
    /**@brief Function for the LEDs initialization.
     *
     * @details Initializes all LEDs used by the application.
     */
    static void buttons_leds_init(void)
    {
        bsp_board_init(BSP_INIT_LEDS);
    }
#endif

