brianreinhold/NordicPHDs/nRF51/ble_app_ghs_bt_sig/main.c
/*
void UART0_IRQHandler_New(app_uart_evt_t * p_app_uart_event)
{

    static uint8_t new_data = p_app_uart_event->data.value;

    // @snippet [Handling the data received over UART]
    // Map it to a user-defined structure that will them be used to populate the
    // update methods.

}
*/


/*
static void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,        // Use parity
          UART_BAUDRATE_BAUDRATE_Baud115200
      };
    err_code = app_uart_init(&comm_params,
                       NULL,
                       UART0_IRQHandler_New,
                       APP_IRQ_PRIORITY_LOW);

    APP_ERROR_CHECK(err_code);
}
*/

static void initializeBluetooth()
{
    uint32_t err_code;
    unsigned char cccds[4];

    memset(cccds, 0, noOfCccds);
    loadKeysFromFlash(&keys, &saveDataBuffer, &saveDataLength, cccds, &noOfCccds);
    initialNumberOfStoredMsmtGroups = numberOfStoredMsmtGroups;
    NRF_LOG_DEBUG("Number of saved stored measurements in flash %u\r\n", numberOfStoredMsmtGroups);
    memcpy(cccdSet, cccds, noOfCccds);  // destination, source, length
    
    if (numberOfStoredMsmtGroups > 0)
    {
        NRF_LOG_DEBUG("Factory timer reset: Current tick %u  Saved time of flash write %u\r\n", getRtcTicks(), latestTimeStamp);
        if (getRtcTicks() < latestTimeStamp)  // Time fault - inspect stored data and set flag on different time line
        {
            setNotOnCurrentTimeline();
        }
    }

        // This also provides the callback method to receive events.
    ble_stack_init();
    sd_mutex_new(&p_mutex);
    sd_mutex_new(&q_mutex);

    // Set device address
    ble_gap_addr_t addrStruct;
    addrStruct.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC;
    memcpy(addrStruct.addr, getBtAddress(), 6);  // destination, source, length
    err_code = sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_NONE, &addrStruct);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not set the Bluetooth Address. Error code %d\r\n", err_code);
        APP_ERROR_CHECK(err_code);
    }

    // Sets max and min connection intervals, slave latency, and the GAP characteristic entries
    // for the friendly name and appearance.
    gap_params_init();
    // Creates the advertisement and scan response data arrays
    err_code = advertisement_ghs_set();
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not configure the advertisements\r\n");
        APP_ERROR_CHECK(err_code);
    }
    
    
    // ===================================== Create the GHS service
    memset(charBuff, 0 ,8);
    err_code = createPrimaryService(&m_ghs_bt_sig_service_handle, BTLE_GHS_BT_SIG_SERVICE);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create GHS service\r\n");
        APP_ERROR_CHECK(err_code);
    }
    
    #if (USES_LIVE_DATA == 1)
    // Create the GHS control point characteristic
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_ghs_bt_sig_cp_handle,
        BTLE_GHS_BT_SIG_CP_CHAR,
        true,   // Has CCCD
        BLE_GATT_HVX_INDICATION,   // This will cause indicate if CCCD is set to true
        8,
        charBuff,   // dummy buffer
        TRAP_WRITE,       // trap read/write with authorize to return a status error
        (ble_gap_conn_sec_mode_t) {1, (SUPPORT_PAIRING + 1)},   // [CCCD write is secured]
        (ble_gap_conn_sec_mode_t) {0, 0},   // Reading characteristic value is forbidden
        (ble_gap_conn_sec_mode_t) {1, 1},   // [Writing characteristic is open]
        true); // Is static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create GHS control point characteristic");
        APP_ERROR_CHECK(err_code);
    }
    // ===================================== Create the GHS BT SIG Live data notification characteristic
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_ghs_bt_sig_live_data_not_handle,
        BTLE_GHS_BT_SIG_LIVE_DATA_NOT_CHAR,
        true,   // Has CCCD
        (BLE_GATT_HVX_INDICATION | BLE_GATT_HVX_NOTIFICATION),  // supports either notification/indication if CCCD is set to true
        0,
        NULL,
        TRAP_NONE,
        (ble_gap_conn_sec_mode_t)
        {
            1, (SUPPORT_PAIRING + 1)    // CCCD write is secured
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Reading characteristic value is forbidden
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Writing characteristic is forbidden
        },
        false); // Not static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create GHS control point characteristic\r\n");
        APP_ERROR_CHECK(err_code);
    }
    #endif
    #if (USES_STORED_DATA == 1)
    // Create the RACP control point characteristic
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_racp_handle,
        BTLE_RACP_CHAR,
        true,   // Has CCCD
        BLE_GATT_HVX_INDICATION,   // This will cause indicate if CCCD is set to true
        8,
        charBuff,   // dummy buffer
        TRAP_WRITE,       // trap read/write with authorize to return a status error
        (ble_gap_conn_sec_mode_t) {1, (SUPPORT_PAIRING + 1)},   // [CCCD write is secured]
        (ble_gap_conn_sec_mode_t) {0, 0},   // Reading characteristic value is forbidden
        (ble_gap_conn_sec_mode_t) {1, 1},   // [Writing characteristic is open]
        true); // Is static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create RACP control point characteristic\r\n");
        APP_ERROR_CHECK(err_code);
    }
    // ===================================== Create the GHS BT SIG Stored data notification characteristic
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_ghs_bt_sig_stored_data_not_handle,
        BTLE_GHS_BT_SIG_STORED_DATA_NOT_CHAR,
        true,   // Has CCCD
        (BLE_GATT_HVX_INDICATION | BLE_GATT_HVX_NOTIFICATION),  // supports either notification/indication if CCCD is set to true
        0,
        NULL,
        TRAP_NONE,
        (ble_gap_conn_sec_mode_t)
        {
            1, (SUPPORT_PAIRING + 1)    // CCCD write is secured
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Reading characteristic value is forbidden
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Writing characteristic is forbidden
        },
        false); // Not static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create the stored data characteristic\r\n");
        APP_ERROR_CHECK(err_code);
    }
    #endif
    // ===================================== Create the GHS Feature characteristic
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_ghs_bt_sig_feature_handle,
        BTLE_GHS_BT_SIG_FEATURE_CHAR,
        false,   // Has CCCD
        BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
        feature_length,
        feature,
        TRAP_NONE,
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // CCCD write forbidden
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            1, 1    // Reading characteristic value is open
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Writing characteristic is forbidden
        },
        true); // Is static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create GHS response characteristic");
        APP_ERROR_CHECK(err_code);
    }

    // ===================================== Create the Security Level characteristic
    // THis is a substitute for the char that should be in the GATT Service
    // but the Nordic API does not allow such an addition
    err_code = createStandardCharacteristic(m_ghs_bt_sig_service_handle,
        &m_ghs_bt_sig_security_handle,
        BTLE_GATT_BT_SIG_SECURITY_CHAR,
        false,   // Has CCCD
        BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
        security_char_length,
        security_char,
        TRAP_NONE,
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // CCCD write forbidden
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            1, 1    // Reading characteristic value is open
        },
        
        (ble_gap_conn_sec_mode_t)
        {
            0, 0    // Writing characteristic is forbidden
        },
        true); // is static
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create GHS response characteristic");
        APP_ERROR_CHECK(err_code);
    }

    // ===================================== Create the Clock Information service
    err_code = createPrimaryService(&m_clock_info_service_handle, BTLE_CLOCK_INFO_SERVICE);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create the Clock Info service\r\n");
        APP_ERROR_CHECK(err_code);
    }
    #if (USES_TIMESTAMP == 1)
    // ===================================== Create the Clock Info characteristic
        err_code = createStandardCharacteristic(m_clock_info_service_handle,
            &m_clock_info_handle,
            BTLE_CLOCK_INFO_CHAR,
            true,  //  CCCD
            BLE_GATT_HVX_INDICATION,
            sTimeInfoData->dataLength,
            sTimeInfoData->timeInfoBuf,
            TRAP_BOTH,   // We need to trap the read to set the time!
            (ble_gap_conn_sec_mode_t)
            {
                1, 1    // CCCD read write is open
            },
            (ble_gap_conn_sec_mode_t)
            {
                1, 1    // Reading is open
            },
            (ble_gap_conn_sec_mode_t)
            {
                1, 1    // Writing characteristic is open
            },
            true); // Is static
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Could not create Clock Info characteristic\r\n");
            APP_ERROR_CHECK(err_code);
        }
    #endif
    // ===================================== Create the DIS
    err_code = createDeviceInformationService(&m_dev_info_service_handle, systemInfo);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Could not create the device information service. Reason %d\r\n", err_code);
    }
    // ===================================== Create the Battery Service
    createBatteryService(&m_battery_service_handle, &batteryCharValue);
    
    NRF_LOG_INFO("GHS Bt Sig Start at time %u!\r\n", getTicks());
    #if (USE_DK == 0)
        bring_up_adver();
    #endif
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    // I do not know where this is established. I don't know what
    // the 'app' event is that triggers this or where it setup.
    uint32_t err_code = sd_app_evt_wait();
    
    if (err_code == NRF_SUCCESS)
    {
        //uint32_t evt_id;
        // Pull event from SOC.
        //err_code = sd_evt_get(&evt_id);
        //NRF_LOG_DEBUG("Soc event # %u\r\n", evt_id);
        return;
    }
    NRF_LOG_DEBUG("sd app evt wait error %u\r\n", err_code);
    APP_ERROR_CHECK(err_code);
}

void main_wait(void)
{
    if (NRF_LOG_PROCESS() == true)
    {
        return;
    }
    power_manage();
}

